package MaximPractice;

public class Numbers {

    //Примитивные типы данный
        // x+3=5
        byte a;                 //2^8 = 256                                     (от -128 до 127)
        short b;                //2^16 = 65.538                                 (от -32786 до 32767)
        int c;                  //2^32 = 4.294.967.296                          (от -2147483648 до 2147483647)
        long d;                 //2^64 = 10.446.744.073.709.551.616             (от 	от -9223372036854775808 до 9223372036854775807 )

        char e;                 //2^16 = 65.538                                 (oт 0 до 65537) кодировка Unicode

        float f;                //2^32                  `                       (от ~-1,4*10^45 до ~3,4,*10^38)
        double g;               //2^64                                          (от ~-4,9*10^324 до ~1,8,*10^308)

        boolean h;              //8 bit (в массивах) ,и 32 bit (не в массивах)
}